#+title: My Literate Emacs Config
#+author: Craig Astill
#+email: craig.astill@gmail.com
#+OPTIONS: num:nil
#+PROPERTY: header-args:mermaid :prologue "exec 2>&1" :epilogue ":" :pupeteer-config-file ~/.puppeteerrc
#+PROPERTY: header-args:shell :prologue "exec 2>&1" :epilogue ":" :results drawer :async
#+STARTUP: show2levels
*** [[https://github.com/pope/ob-go][ob-go]]:
Go support in org-code blocks.
#+BEGIN_SRC emacs-lisp
  (use-package ob-go :ensure t)
#+END_SRC

This will allow the following code block to run:
#+begin_src go :imports '("fmt" "time")
  fmt.Println("Current Time:", time.Now())
#+end_src

#+RESULTS:
: Current Time: 2023-06-30 14:35:27.486993 +0100 BST m=+0.000096251

** php:
Need to run the [[https://github.com/felixfbecker/php-language-server][php-language-server]] for eglot to connect to:

#+BEGIN_SRC shell
  docker kill php-language-server
  docker rm php-language-server
  docker pull felixfbecker/php-language-server
  docker run --detach -p2088:2088 --restart=always --name php-language-server felixfbecker/php-language-server
#+END_SRC

#+RESULTS:
:results:
Error response from daemon: Cannot kill container: php-language-server: Container 324c6a791b156af6e0750a66382e36b38382d08e1e8638b2a4f5199db1524f85 is not running
php-language-server
Using default tag: latest
latest: Pulling from felixfbecker/php-language-server
Digest: sha256:37f33344e6c683cac03a039c053c01d0cb006c3d7d671339ed638e1b22206b16
Status: Image is up to date for felixfbecker/php-language-server:latest
docker.io/felixfbecker/php-language-server:latest

What's Next?
  1. Sign in to your Docker account → docker login
  2. View a summary of image vulnerabilities and recommendations → docker scout quickview felixfbecker/php-language-server
WARNING: The requested image's platform (linux/amd64) does not match the detected host platform (linux/arm64/v8) and no specific platform was requested
b9a761ffbf9a77c0fa4fbdbc390e7f43977f75338963d7285232766297d903c2
:end:

NOTE: On Mac's; eglot will not connect if it is set to =localhost=!

#+BEGIN_SRC emacs-lisp
  (use-package php-mode
    :ensure t
    :defer t
    :mode ("\\.php\\'" . php-mode)
    :hook (
           (php-mode-hook . my-programming-defaults-config)
           (php-mode . eglot-ensure)
           )
    ;; :custom
    ;; ;; See: https://2metz.fr/blog/configuring-emacs-eglot-lsp-with-docker-containers/
    ;; ;; for an example of eglot starting docker containers.
    ;; (eglot-withhold-process-id "1")
    :config
    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
                   '(php-mode . ("127.0.0.1" 2088))))
    )
  ;;                   '(php-mode . ("docker" "run" "--rm" "--detach" "--name=php-language-server" "felixfbecker/php-language-server"))))
#+END_SRC
